function startSearch() {
  const inputA = document.getElementById("inputA").value;
  const inputB = document.getElementById("inputB").value;
  const searchParams = new URLSearchParams({ a: inputA, b: inputB });
  window.location.href = `search.html?${searchParams.toString()}`;
}

var swiper = new Swiper(".mySwiper", {
  slidesPerView: 1,
  spaceBetween: 30,
  loop: true,
  pagination: {
    el: ".swiper-pagination",
    clickable: true,
  },
  navigation: {
    nextEl: ".swiper-button-next",
    prevEl: ".swiper-button-prev",
  },
});

const routes = [
  {
    passport: "passport",
    from: "Мелитополь",
    to: "Варшава",
    fromDetail: "Центральный автовокзал",
    toDetail: "Авто/жд вокзал Варшава Заходня",
    price: "350 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Мелитополь",
    toNot: "Варшава",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Авто/жд вокзал Варшава Заходня",
    priceNot: "350 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Мелитополь",
    to: "Киев",
    fromDetail: "Центральный автовокзал",
    toDetail: "Центральный ж/д вокзал Киева",
    price: "400 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Мелитополь",
    toNot: "Киев",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Центральный ж/д вокзал Киева",
    priceNot: "400 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Мелитополь",
    to: "Берлин",
    fromDetail: "Центральный автовокзал",
    toDetail: "Автовокзал Берлин",
    price: "400 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Мелитополь",
    toNot: "Берлин",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Автовокзал Берлин",
    priceNot: "400 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Бердянск",
    to: "Варшава",
    fromDetail: "Центральный автовокзал",
    toDetail: "Авто/жд вокзал Варшава Заходня",
    price: "300 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Бердянск",
    toNot: "Варшава",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Авто/жд вокзал Варшава Заходня",
    priceNot: "300 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Бердянск",
    to: "Киев",
    fromDetail: "Центральный автовокзал",
    toDetail: "Центральный ж/д вокзал Киева",
    price: "350 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Бердянск",
    toNot: "Киев",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Центральный ж/д вокзал Киева",
    priceNot: "350 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Бердянск",
    to: "Берлин",
    fromDetail: "Центральный автовокзал",
    toDetail: "Автовокзал Берлин",
    price: "400 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Бердянск",
    toNot: "Берлин",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Автовокзал Берлин",
    priceNot: "400 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Мариуполь",
    to: "Варшава",
    fromDetail: "Центральный автовокзал",
    toDetail: "Авто/жд вокзал Варшава Заходня",
    price: "250 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Мариуполь",
    toNot: "Варшава",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Авто/жд вокзал Варшава Заходня",
    priceNot: "250 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Мариуполь",
    to: "Киев",
    fromDetail: "Центральный автовокзал",
    toDetail: "Центральный ж/д вокзал Киева",
    price: "300 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Мариуполь",
    toNot: "Киев",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Центральный ж/д вокзал Киева",
    priceNot: "300 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Мариуполь",
    to: "Берлин",
    fromDetail: "Центральный автовокзал",
    toDetail: "Автовокзал Берлин",
    price: "350 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Мариуполь",
    toNot: "Берлин",
    fromDetailNot: "Центральный автовокзал",
    toDetailNot: "Автовокзал Берлин",
    priceNot: "350 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Минск",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Минска",
    price: "150 €",
    Traveltime: "24",
    information:
      "Отправление- 07.00<br>В пути: до Минска 24 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Центральный автовокзал<br>Расстояние: 1800 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Минск",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Минска",
    priceNot: "150 €",
    TraveltimeNot: "24",
    informationNot:
      "Отправление- 07.00<br>В пути: до Минска 24 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Центральный автовокзал<br>Расстояние: 1800 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Германия",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Берлина",
    price: "400 €",
    Traveltime: "72",
    information:
      "Отправление- 07.00<br>В пути: до Берлина 72 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Центральный автовокзал<br>Расстояние: 3500 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Германия",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Берлина",
    priceNot: "400 €",
    TraveltimeNot: "72",
    informationNot:
      "Отправление- 07.00<br>В пути: до Берлина 72 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Центральный автовокзал<br>Расстояние: 3500 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Польша",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Авто/жд вокзал Варшава Заходня",
    price: "250 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Польша",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Авто/жд вокзал Варшава Заходня",
    priceNot: "250 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Литва",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Вильнюса",
    price: "250 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Вильнюса 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Вильнюс: Центральный автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Литва",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Вильнюса",
    priceNot: "250 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Вильнюса 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Вильнюс: Центральный автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Латвия",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Риги",
    price: "250 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Риги 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Ригу: Центральный автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Латвия",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Риги",
    priceNot: "250 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Риги 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Ригу: Центральный автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Эстония",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Таллинна",
    price: "250 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Таллинна 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Таллинн: Центральный автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Эстония",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Таллинна",
    priceNot: "250 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Таллинна 48 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Таллинн: Центральный автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Львов",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Львова",
    price: "300 €",
    Traveltime: "24",
    information:
      "Отправление- 07.00<br>В пути: до Львова 24 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия во Львов: Центральный автовокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Львов",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Львова",
    priceNot: "300 €",
    TraveltimeNot: "24",
    informationNot:
      "Отправление- 07.00<br>В пути: до Львова 24 часа (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия во Львов: Центральный автовокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Житомир",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Житомира",
    price: "300 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Житомира 20 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Житомир: Центральный автовокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Житомир",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Житомира",
    priceNot: "300 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Житомира 20 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Житомир: Центральный автовокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Киев",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный ж/д вокзал Киева",
    price: "300 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Киев",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный ж/д вокзал Киева",
    priceNot: "300 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Полтава",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Полтавы",
    price: "300 €",
    Traveltime: "18",
    information:
      "Отправление- 07.00<br>В пути: до Полтавы 18 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Полтаву: Центральный автовокзал<br>Расстояние: 1300 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Полтава",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Полтавы",
    priceNot: "300 €",
    TraveltimeNot: "18",
    informationNot:
      "Отправление- 07.00<br>В пути: до Полтавы 18 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Полтаву: Центральный автовокзал<br>Расстояние: 1300 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Харьков",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Харькова",
    price: "350 €",
    Traveltime: "16",
    information:
      "Отправление- 07.00<br>В пути: до Харькова 16 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Харьков: Центральный автовокзал<br>Расстояние: 1200 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Харьков",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Харькова",
    priceNot: "350 €",
    TraveltimeNot: "16",
    informationNot:
      "Отправление- 07.00<br>В пути: до Харькова 16 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Харьков: Центральный автовокзал<br>Расстояние: 1200 км.",
  },
  {
    passport: "passport",
    from: "Донецк",
    to: "Днепр",
    fromDetail: "Ав Южный, Мотель, Макеевка",
    toDetail: "Центральный автовокзал Днепра",
    price: "350 €",
    Traveltime: "15",
    information:
      "Отправление- 07.00<br>В пути: до Днепра 15 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Днепр: Центральный автовокзал<br>Расстояние: 1100 км.",
    passportNot: "passportNot",
    fromNot: "Донецк",
    toNot: "Днепр",
    fromDetailNot: "Ав Южный, Мотель, Макеевка",
    toDetailNot: "Центральный автовокзал Днепра",
    priceNot: "350 €",
    TraveltimeNot: "15",
    informationNot:
      "Отправление- 07.00<br>В пути: до Днепра 15 часов (без учёта таможни)<br>Место отправления: Ав Южный, Мотель, Макеевка<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Днепр: Центральный автовокзал<br>Расстояние: 1100 км.",
  },
  {
    passport: "passport",
    from: "Луганск",
    to: "Киев",
    fromDetail: "Центральный автовокзал Луганска",
    toDetail: "Центральный ж/д вокзал Киева",
    price: "350 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Луганск",
    toNot: "Киев",
    fromDetailNot: "Центральный автовокзал Луганска",
    toDetailNot: "Центральный ж/д вокзал Киева",
    priceNot: "350 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Киева 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Киев: Центральный ж/д вокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Луганск",
    to: "Польша",
    fromDetail: "Центральный автовокзал Луганска",
    toDetail: "Авто/жд вокзал Варшава Заходня",
    price: "300 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Луганск",
    toNot: "Польша",
    fromDetailNot: "Центральный автовокзал Луганска",
    toDetailNot: "Авто/жд вокзал Варшава Заходня",
    priceNot: "300 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Варшавы 36 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Варшаву: Авто/жд вокзал Варшава Заходня<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Луганск",
    to: "Берлин",
    fromDetail: "Центральный автовокзал Луганска",
    toDetail: "Центральный автовокзал Берлина",
    price: "350 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Центральный автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Луганск",
    toNot: "Берлин",
    fromDetailNot: "Центральный автовокзал Луганска",
    toDetailNot: "Центральный автовокзал Берлина",
    priceNot: "350 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Берлина 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Луганска<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Берлин: Центральный автовокзал<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Киев",
    to: "Минск",
    fromDetail: "Центральный автовокзал Киева",
    toDetail: "Минский аэропорт",
    price: "200 €",
    Traveltime: "10",
    information:
      "Отправление- 07.00<br>В пути: до Минского аэропорта 10 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Минский аэропорт<br>Расстояние: 700 км.",
    passportNot: "passportNot",
    fromNot: "Киев",
    toNot: "Минск",
    fromDetailNot: "Центральный автовокзал Киева",
    toDetailNot: "Минский аэропорт",
    priceNot: "200 €",
    TraveltimeNot: "10",
    informationNot:
      "Отправление- 07.00<br>В пути: до Минского аэропорта 10 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Минский аэропорт<br>Расстояние: 700 км.",
  },
  {
    passport: "passport",
    from: "Киев",
    to: "Луганск",
    fromDetail: "Центральный ж/д вокзал Киева",
    toDetail: "Центральный автовокзал Луганска",
    price: "350 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Луганска 20 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Киев",
    toNot: "Луганск",
    fromDetailNot: "Центральный ж/д вокзал Киева",
    toDetailNot: "Центральный автовокзал Луганска",
    priceNot: "350 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Луганска 20 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Киев",
    to: "Донецк",
    fromDetail: "Центральный ж/д вокзал Киева",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "300 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 20 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Киев",
    toNot: "Донецк",
    fromDetailNot: "Центральный ж/д вокзал Киева",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "300 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 20 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Киев",
    to: "Мелитополь",
    fromDetail: "Центральный ж/д вокзал Киева",
    toDetail: "Центральный автовокзал Мелитополя",
    price: "350 €",
    Traveltime: "18",
    information:
      "Отправление- 07.00<br>В пути: до Мелитополя 18 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 1300 км.",
    passportNot: "passportNot",
    fromNot: "Киев",
    toNot: "Мелитополь",
    fromDetailNot: "Центральный ж/д вокзал Киева",
    toDetailNot: "Центральный автовокзал Мелитополя",
    priceNot: "350 €",
    TraveltimeNot: "18",
    informationNot:
      "Отправление- 07.00<br>В пути: до Мелитополя 18 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 1300 км.",
  },
  {
    passport: "passport",
    from: "Киев",
    to: "Бердянск",
    fromDetail: "Центральный ж/д вокзал Киева",
    toDetail: "Центральный автовокзал Бердянска",
    price: "350 €",
    Traveltime: "18",
    information:
      "Отправление- 07.00<br>В пути: до Бердянска 18 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 1300 км.",
    passportNot: "passportNot",
    fromNot: "Киев",
    toNot: "Бердянск",
    fromDetailNot: "Центральный ж/д вокзал Киева",
    toDetailNot: "Центральный автовокзал Бердянска",
    priceNot: "350 €",
    TraveltimeNot: "18",
    informationNot:
      "Отправление- 07.00<br>В пути: до Бердянска 18 часов (без учёта таможни)<br>Место отправления: Центральный ж/д вокзал Киева<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 1300 км.",
  },
  {
    passport: "passport",
    from: "Днепр",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Днепра",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "350 €",
    Traveltime: "12",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 12 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Днепра<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 800 км.",
    passportNot: "passportNot",
    fromNot: "Днепр",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Днепра",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "350 €",
    TraveltimeNot: "12",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 12 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Днепра<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 800 км.",
  },
  {
    passport: "passport",
    from: "Полтава",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Полтавы",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "350 €",
    Traveltime: "12",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 12 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Полтавы<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 800 км.",
    passportNot: "passportNot",
    fromNot: "Полтава",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Полтавы",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "350 €",
    TraveltimeNot: "12",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 12 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Полтавы<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 800 км.",
  },
  {
    passport: "passport",
    from: "Харьков",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Харькова",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "370 €",
    Traveltime: "10",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 10 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Харькова<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 700 км.",
    passportNot: "passportNot",
    fromNot: "Харьков",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Харькова",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "370 €",
    TraveltimeNot: "10",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 10 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Харькова<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 700 км.",
  },
  {
    passport: "passport",
    from: "Львов",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Львова",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "300 €",
    Traveltime: "24",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 24 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Львова<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1500 км.",
    passportNot: "passportNot",
    fromNot: "Львов",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Львова",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "300 €",
    TraveltimeNot: "24",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 24 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Львова<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1500 км.",
  },
  {
    passport: "passport",
    from: "Житомир",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Житомира",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "350 €",
    Traveltime: "20",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Житомира<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1200 км.",
    passportNot: "passportNot",
    fromNot: "Житомир",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Житомира",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "350 €",
    TraveltimeNot: "20",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 20 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Житомира<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 1200 км.",
  },
  {
    passport: "passport",
    from: "Польша",
    to: "Донецк",
    fromDetail: "Авто/жд вокзал Варшава Заходня",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "250 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Польша",
    toNot: "Донецк",
    fromDetailNot: "Авто/жд вокзал Варшава Заходня",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "250 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Польша",
    to: "Луганск",
    fromDetail: "Авто/жд вокзал Варшава Заходня",
    toDetail: "Центральный автовокзал Луганска",
    price: "300 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Луганска 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Польша",
    toNot: "Луганск",
    fromDetailNot: "Авто/жд вокзал Варшава Заходня",
    toDetailNot: "Центральный автовокзал Луганска",
    priceNot: "300 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Луганска 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Варшава",
    to: "Минск",
    fromDetail: "Авто/жд вокзал Варшава Заходня",
    toDetail: "Минский аэропорт",
    price: "150 €",
    Traveltime: "10",
    information:
      "Отправление- 07.00<br>В пути: до Минского аэропорта 10 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Минский аэропорт<br>Расстояние: 700 км.",
    passportNot: "passportNot",
    fromNot: "Варшава",
    toNot: "Минск",
    fromDetailNot: "Авто/жд вокзал Варшава Заходня",
    toDetailNot: "Минский аэропорт",
    priceNot: "150 €",
    TraveltimeNot: "10",
    informationNot:
      "Отправление- 07.00<br>В пути: до Минского аэропорта 10 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Минск: Минский аэропорт<br>Расстояние: 700 км.",
  },
  {
    passport: "passport",
    from: "Варшава",
    to: "Мелитополь",
    fromDetail: "Авто/жд вокзал Варшава Заходня",
    toDetail: "Центральный автовокзал Мелитополя",
    price: "330 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Мелитополя 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Варшава",
    toNot: "Мелитополь",
    fromDetailNot: "Авто/жд вокзал Варшава Заходня",
    toDetailNot: "Центральный автовокзал Мелитополя",
    priceNot: "330 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Мелитополя 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Варшава",
    to: "Бердянск",
    fromDetail: "Авто/жд вокзал Варшава Заходня",
    toDetail: "Центральный автовокзал Бердянска",
    price: "300 €",
    Traveltime: "36",
    information:
      "Отправление- 07.00<br>В пути: до Бердянска 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 2700 км.",
    passportNot: "passportNot",
    fromNot: "Варшава",
    toNot: "Бердянск",
    fromDetailNot: "Авто/жд вокзал Варшава Заходня",
    toDetailNot: "Центральный автовокзал Бердянска",
    priceNot: "300 €",
    TraveltimeNot: "36",
    informationNot:
      "Отправление- 07.00<br>В пути: до Бердянска 36 часов (без учёта таможни)<br>Место отправления: Авто/жд вокзал Варшава Заходня<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 2700 км.",
  },
  {
    passport: "passport",
    from: "Германия",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Берлина",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "400 €",
    Traveltime: "72",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3500 км.",
    passportNot: "passportNot",
    fromNot: "Германия",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Берлина",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "400 €",
    TraveltimeNot: "72",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3500 км.",
  },
  {
    passport: "passport",
    from: "Берлин",
    to: "Луганск",
    fromDetail: "Центральный автовокзал Берлина",
    toDetail: "Центральный автовокзал Луганска",
    price: "400 €",
    Traveltime: "72",
    information:
      "Отправление- 07.00<br>В пути: до Луганска 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 3500 км.",
    passportNot: "passportNot",
    fromNot: "Берлин",
    toNot: "Луганск",
    fromDetailNot: "Центральный автовокзал Берлина",
    toDetailNot: "Центральный автовокзал Луганска",
    priceNot: "400 €",
    TraveltimeNot: "72",
    informationNot:
      "Отправление- 07.00<br>В пути: до Луганска 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Луганск: Центральный автовокзал<br>Расстояние: 3500 км.",
  },
  {
    passport: "passport",
    from: "Берлин",
    to: "Мелитополь",
    fromDetail: "Центральный автовокзал Берлина",
    toDetail: "Центральный автовокзал Мелитополя",
    price: "450 €",
    Traveltime: "72",
    information:
      "Отправление- 07.00<br>В пути: до Мелитополя 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 3500 км.",
    passportNot: "passportNot",
    fromNot: "Берлин",
    toNot: "Мелитополь",
    fromDetailNot: "Центральный автовокзал Берлина",
    toDetailNot: "Центральный автовокзал Мелитополя",
    priceNot: "450 €",
    TraveltimeNot: "72",
    informationNot:
      "Отправление- 07.00<br>В пути: до Мелитополя 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мелитополь: Центральный автовокзал<br>Расстояние: 3500 км.",
  },
  {
    passport: "passport",
    from: "Берлин",
    to: "Бердянск",
    fromDetail: "Центральный автовокзал Берлина",
    toDetail: "Центральный автовокзал Бердянска",
    price: "450 €",
    Traveltime: "72",
    information:
      "Отправление- 07.00<br>В пути: до Бердянска 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 3500 км.",
    passportNot: "passportNot",
    fromNot: "Берлин",
    toNot: "Бердянск",
    fromDetailNot: "Центральный автовокзал Берлина",
    toDetailNot: "Центральный автовокзал Мелитополя",
    priceNot: "450 €",
    TraveltimeNot: "72",
    informationNot:
      "Отправление- 07.00<br>В пути: до Бердянска 72 часа (без учёта таможни)<br>Место отправления: Центральный автовокзал Берлина<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Бердянск: Центральный автовокзал<br>Расстояние: 3500 км.",
  },
  {
    passport: "passport",
    from: "Литва",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Вильнюса",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "250 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Вильнюса<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Литва",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Вильнюса",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "250 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Вильнюса<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Латвия",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Риги",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "300 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Риги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Латвия",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Риги",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "300 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Риги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Эстония",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Таллинна",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "300 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Таллинна<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Эстония",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Таллинна",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "300 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Таллинна<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Чехия",
    to: "Донецк",
    fromDetail: "Центральный автовокзал Праги",
    toDetail: "Ав Южный, Мотель, Макеевка",
    price: "400 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Праги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Чехия",
    toNot: "Донецк",
    fromDetailNot: "Центральный автовокзал Праги",
    toDetailNot: "Ав Южный, Мотель, Макеевка",
    priceNot: "400 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Донецка 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Праги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Донецк: Ав Южный, Мотель, Макеевка<br>Расстояние: 3000 км.",
  },
  {
    passport: "passport",
    from: "Чехия",
    to: "Мариуполь",
    fromDetail: "Центральный автовокзал Праги",
    toDetail: "Центральный автовокзал Мариуполя",
    price: "400 €",
    Traveltime: "48",
    information:
      "Отправление- 07.00<br>В пути: до Мариуполя 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Праги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мариуполь: Центральный автовокзал<br>Расстояние: 3000 км.",
    passportNot: "passportNot",
    fromNot: "Чехия",
    toNot: "Мариуполь",
    fromDetailNot: "Центральный автовокзал Праги",
    toDetailNot: "Центральный автовокзал Мариуполя",
    priceNot: "400 €",
    TraveltimeNot: "48",
    informationNot:
      "Отправление- 07.00<br>В пути: до Мариуполя 48 часов (без учёта таможни)<br>Место отправления: Центральный автовокзал Праги<br>Пункт пропуска: Успенка/Терехово/Шегени(могут изм.)<br>Место прибытия в Мариуполь: Центральный автовокзал<br>Расстояние: 3000 км.",
  },
];

function getSearchParams() {
  const params = new URLSearchParams(window.location.search);
  return {
    a: params.get("a") ? decodeURIComponent(params.get("a")) : "",
    b: params.get("b") ? decodeURIComponent(params.get("b")) : "",
  };
}

function displaySearchResults(searchParams) {
  const resultsContainer = document.getElementById("searchResults");
  const searchResultsBlock = document.getElementById("searchResultsBlock");
  resultsContainer.innerHTML = ""; // Очищаем контейнер перед обновлением
  const matchingRoutes = routes.filter(
    (route) =>
      route.from.toLowerCase() === searchParams.a.toLowerCase() &&
      route.to.toLowerCase() === searchParams.b.toLowerCase()
  );

  if (matchingRoutes.length > 0) {
    matchingRoutes.forEach((route) => {
      const offerElement = document.createElement("div");
      offerElement.className = "";

      const routeDetails = `
          <div class="passport"><img class="imgpassport" src="./img/free-icon-passport-3125661 2.svg"/><a>При наличии паспорта РФ</a></div>
          <div class="offer">
            <div class="route">
              <div class="route-details">
                <div class="city from-city">
                  <p>${route.from}</p>
                  <p class="from-to-det">${route.fromDetail}</p>
                </div>
                <div class="line"><img class="imgline" src="./img/Line 9.svg"/></div>
                <div class="city to-city">
                  <p>${route.to}</p>
                  <p class="from-to-det">${route.toDetail}</p>
                </div>
                <div class="price-price">
                  <p>${route.price}</p>
                </div>
              </div>
              <div class="price-details">
                <p class="Bus">
                  <img class="imgBos Buuus" src="./img/микроавтобус.svg"/>
                  <a class="aBus Buuus">Автобус: Без остоновок </a>
                </p>
                <img class="img2Bos" src="./img/вай фай.svg"/>
                <img class="img3Bos" src="./img/розетка.svg"/>
                <p class="Traveltime Buuus">
                  <a>${route.Traveltime} часов в пути без таможни</a>
                </p>
                <button class="details-btn"><a>Подробности</a></button>
              </div>
            </div>
            <div class="details" style="display:none;">
              <p>${route.information}</p>
              <a class="details-btn2" href="https://youtu.be/x5HqcwD4Sxs?t=15">Подробности</a>
            </div>
          </div>
  
          <div class="passport offerrpassport"><img class="imgpassport" src="./img/free-icon-passport-3125661 2.svg"/><a>Без наличия паспорта РФ</a></div>
          <div class="offerr">
            <div class="route">
              <div class="route-details">
                <div class="city from-city">
                  <p>${route.fromNot}</p>
                  <p class="from-to-det">${route.fromDetailNot}</p>
                </div>
                <div class="line2"><img class="imgline2" src="./img/Line 9.svg"/></div>
                <div class="city to-city">
                  <p>${route.toNot}</p>
                  <p class="from-to-det"><a>${route.toDetailNot}</a></p>
                </div>
                <div class="price-price">
                  <p>от ${route.priceNot}</p>
                </div>
              </div>
              <div class="price-details">
                <p class="Bus">
                  <img class="imgBos" src="./img/микроавтобус.svg"/>
                  <a class="aBus">Автобус: Без остоновок </a>
                </p>
                <img class="img2Bos" src="./img/вай фай.svg"/>
                <img class="img3Bos" src="./img/розетка.svg"/>
                <p class="Traveltime">
                  <a>${route.TraveltimeNot} часов в пути без таможни</a>
                </p>
                <button class="details-btn"><a>Подробности</a></button>
              </div>
            </div>
            <div class="details" style="display:none;">
              <p>${route.informationNot}</p>
              <a class="details-btn2" href="https://youtu.be/x5HqcwD4Sxs?t=15">Подробности</a>
            </div>
          </div>
        `;
      AOS.init();

      offerElement.innerHTML = routeDetails;
      resultsContainer.appendChild(offerElement);
      resultsContainer.classList.remove("no-route-found");
    });

    // Назначаем обработчики событий для всех кнопок "Подробности"
    document.querySelectorAll(".details-btn").forEach((button) => {
      button.addEventListener("click", function () {
        const details = this.parentElement.parentElement.nextElementSibling;
        if (details.style.display === "none" || details.style.display === "") {
          details.style.display = "block";
          this.textContent = "Скрыть";
          details.scrollIntoView({ behavior: "smooth" });
          AOS.init();
        } else {
          details.style.display = "none";
          this.textContent = "Подробности";
          AOS.init();
        }
      });
    });
  } else {
    resultsContainer.textContent = "Маршрут не найден.";
    resultsContainer.classList.add("no-route-found");
  }
  searchResultsBlock.style.display = "block";
  searchResultsBlock.scrollIntoView({ behavior: "smooth" }); // Прокручиваем к блоку с результатами
}

function updateSearchResults() {
  const inputA = document.getElementById("inputA").value.trim();
  const inputB = document.getElementById("inputB").value.trim();
  const searchParams = { a: inputA, b: inputB };
  displaySearchResults(searchParams);
}

function displayPredefinedRoute(from, to) {
  const searchParams = { a: from, b: to };
  displaySearchResults(searchParams);
}

window.onload = function () {
  const searchParams = getSearchParams();
  if (searchParams.a && searchParams.b) {
    document.getElementById("inputA").value = searchParams.a;
    document.getElementById("inputB").value = searchParams.b;
    displaySearchResults(searchParams);
  }
};
document.getElementById("toggleButton").addEventListener("click", function () {
  const animatedBlock = document.getElementById("animatedBlock");
  animatedBlock.classList.toggle("visible");

  if (animatedBlock.classList.contains("visible")) {
    console.log("Adding content to animatedBlock");
    this.textContent = "Свернуть";
    animatedBlock.innerHTML = `
    <div class="divider"></div>
    <div class="top-toggle-13">
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мелитополь', 'Варшава')"
            >
              <span class="route-13">Мелитополь - Варшава</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мелитополь', 'Киев')"
            >
              <span class="route-13">Мелитополь - Киев</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мелитополь', 'Берлин')"
            >
              <span class="route-13">Мелитополь - Берлин</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Бердянск', 'Варшава')"
            >
              <span class="route-13">Бердянск - Варшава</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Бердянск', 'Киев')"
            >
              <span class="route-13">Бердянск - Киев</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Бердянск', 'Берлин')"
            >
              <span class="route-13">Бердянск - Берлин</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мариуполь', 'Варшава')"
            >
              <span class="route-13">Мариуполь - Варшава</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мариуполь', 'Киев')"
            >
              <span class="route-13">Мариуполь - Киев</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Мариуполь', 'Берлин')"
            >
              <span class="route-13">Мариуполь - Берлин</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Минск')"
            >
              <span class="route-13">Донецк - Минск</span>
              <span class="price-13"
                >от 150 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Германия')"
            >
              <span class="route-13">Донецк - Германия</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Польша')"
            >
              <span class="route-13">Донецк - Польша</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Литва')"
            >
              <span class="route-13">Донецк - Литва</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Латвия')"
            >
              <span class="route-13">Донецк - Латвия</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Эстония')"
            >
              <span class="route-13">Донецк - Эстония</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Львов')"
            >
              <span class="route-13">Донецк - Львов</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Житомир')"
            >
              <span class="route-13">Донецк - Житомир</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Киев')"
            >
              <span class="route-13">Донецк - Киев</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Полтава')"
            >
              <span class="route-13">Донецк - Полтава</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Донецк', 'Харьков')"
            >
              <span class="route-13">Донецк - Харьков</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Днепр', 'Донецк')"
            >
              <span class="route-13">Днепр - Донецк</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Полтава', 'Донецк')"
            >
              <span class="route-13">Полтава - Донецк</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Харьков', 'Донецк')"
            >
              <span class="route-13">Харьков - Донецк</span>
              <span class="price-13"
                >от 370 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Львов', 'Донецк')"
            >
              <span class="route-13">Львов - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Житомир', 'Донецк')"
            >
              <span class="route-13">Житомир - Донецк</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
            
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Польша', 'Донецк')"
              
            >
              <span class="route-13">Польша - Донецк</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Польша', 'Луганск')"
            >
              <span class="route-13">Польша - Луганск</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Минск')"
            >
              <span class="route-13">Варшава - Минск</span>
              <span class="price-13"
                >от 150 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Мелитополь')"
            >
              <span class="route-13">Варшава - Мелитополь</span>
              <span class="price-13"
                >от 330 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Бердянск')"
            >
              <span class="route-13">Варшава - Бердянск</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Германия', 'Донецк')"
            >
              <span class="route-13">Германия - Донецк</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Луганск')"
            >
              <span class="route-13">Берлин - Луганск</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Мелитополь')"
            >
              <span class="route-13">Берлин - Мелитополь</span>
              <span class="price-13"
                >от 450 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Бердянск')"
            >
              <span class="route-13">Берлин - Бердянск</span>
              <span class="price-13"
                >от 450 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Чехия', 'Донецк')"
            >
              <span class="route-13">Чехия - Донецк</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Чехия', 'Мариуполь')"
            >
              <span class="route-13">Чехия - Мариуполь</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Литва', 'Донецк')"
            >
              <span class="route-13">Литва - Донецк</span>
              <span class="price-13"
                >от 250 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Латвия', 'Донецк')"
            >
              <span class="route-13">Латвия - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Киев', 'Минск')"
            >
              <span class="route-13">Киев - Минск</span>
              <span class="price-13"
                >от 200 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Киев', 'Луганск')"
            >
              <span class="route-13">Киев - Луганск</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Киев', 'Донецк')"
            >
              <span class="route-13">Киев - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Киев', 'Мелитополь')"
            >
              <span class="route-13">Киев - Мелитополь</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Киев', 'Бердянск')"
            >
              <span class="route-13">Киев - Бердянск</span>
              <span class="price-13"
                >от 350 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Минск')"
            >
              <span class="route-13">Варшава - Минск</span>
              <span class="price-13"
                >от 150 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-down"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Мелитополь')"
            >
              <span class="route-13">Варшава - Мелитополь</span>
              <span class="price-13"
                >от 330 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Варшава', 'Бердянск')"
            >
              <span class="route-13">Варшава - Бердянск</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Германия', 'Донецк')"
            >
              <span class="route-13">Германия - Донецк</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Луганск')"
            >
              <span class="route-13">Берлин - Луганск</span>
              <span class="price-13"
                >от 400 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Мелитополь')"
            >
              <span class="route-13">Берлин - Мелитополь</span>
              <span class="price-13"
                >от 450 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Берлин', 'Бердянск')"
            >
              <span class="route-13">Берлин - Бердянск</span>
              <span class="price-13"
                >от 450 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem3-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Латвия', 'Донецк')"
            >
              <span class="route-13">Латвия - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Эстония', 'Донецк')"
            >
              <span class="route-13">Эстония - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div
            class="button-item-13 butitem2-13"
            data-aos="flip-up"
            data-aos-duration="1000"
          >
            <button
              type="button"
              class="search-button-13"
              onclick="displayPredefinedRoute('Эстония', 'Донецк')"
            >
              <span class="route-13">Эстония - Донецк</span>
              <span class="price-13"
                >от 300 €
                <img
                  class="search_icon-13"
                  src="./icon_сontact/search_icon.png"
                  alt="search_icon"
                />
              </span>
            </button>
          </div>
          <div>
            <h1 class="target-h1">
              Если вы не нашли нужный маршрут, это не значит, что мы его не
              предоставляем. Просто свяжитесь с нами, и мы постараемся помочь!
            </h1>
          </div>
        </div>`;
    AOS.init();
  } else {
    console.log("Removing content from animatedBlock");
    this.textContent = "Все маршруты";
    animatedBlock.innerHTML = "";
    AOS.init();
  }
});
